wallet.postman_collection.json

{
	"info": {
		"_postman_id": "04b78850-f136-4e4c-b32c-f6f2e932e8bb",
		"name": "wallet",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "6169773"
	},
	"item": [
		{
			"name": "soap",
			"item": [
				{
					"name": "registerClientRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml",
								"type": "text"
							}
						],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soap=\"http://localhost:8000/soap\">\n   <soapenv:Header/>\n  <soapenv:Body>\n          <soap:registerClientRequest>\n             <document>12345678</document>\n             <name>Jorge Castillo</name>\n             <email>jorge@example.com</email>\n             <phone>+51999999999</phone>\n          </soap:registerClientRequest>\n       </soapenv:Body>\n</soapenv:Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://localhost:8000/soap",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8000",
							"path": [
								"soap"
							]
						}
					},
					"response": []
				},
				{
					"name": "getBalanceRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soap=\"http://localhost:8000/soap\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <soap:getBalanceRequest>\n         <document>12345678</document>\n      </soap:getBalanceRequest>\n   </soapenv:Body>\n</soapenv:Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://localhost:8000/soap",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8000",
							"path": [
								"soap"
							]
						}
					},
					"response": []
				},
				{
					"name": "loadBalanceRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soap=\"http://localhost:8000/soap\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <soap:loadBalanceRequest>\n         <document>12345678</document>\n         <amount>100.00</amount>\n      </soap:loadBalanceRequest>\n   </soapenv:Body>\n</soapenv:Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://localhost:8000/soap",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8000",
							"path": [
								"soap"
							]
						}
					},
					"response": []
				},
				{
					"name": "createPaymentSessionRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soap=\"http://localhost:8000/soap\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <soap:createPaymentSessionRequest>\n         <document>12345678</document>\n         <amount>50.00</amount>\n      </soap:createPaymentSessionRequest>\n   </soapenv:Body>\n</soapenv:Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://localhost:8000/soap",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8000",
							"path": [
								"soap"
							]
						}
					},
					"response": []
				},
				{
					"name": "confirmPaymentRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soap=\"http://localhost:8000/soap\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <soap:confirmPaymentRequest>\n         <token>495ac3283f6e154891e11e9ad2677b21</token>\n         <amount>50.00</amount>\n      </soap:confirmPaymentRequest>\n   </soapenv:Body>\n</soapenv:Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "http://localhost:8000/soap",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "8000",
							"path": [
								"soap"
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "api-rest",
			"item": [
				{
					"name": "registerClientRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "{\n  \"document\": \"123456789\",\n  \"name\": \"John Doe\",\n  \"email\": \"john@example.com\",\n  \"phone\": \"123456789\"\n}",
							"options": {
								"raw": {
									"language": "json"
								}
							}
						},
						"url": {
							"raw": "http://localhost:3000/api/wallet/register",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "3000",
							"path": [
								"api",
								"wallet",
								"register"
							]
						}
					},
					"response": []
				},
				{
					"name": "getBalanceRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "GET",
						"header": [],
						"url": {
							"raw": "http://localhost:3000/api/wallet//balance/123456789",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "3000",
							"path": [
								"api",
								"wallet",
								"",
								"balance",
								"123456789"
							]
						}
					},
					"response": []
				},
				{
					"name": "loadBalanceRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "{\n  \"document\": \"123456789\",\n  \"amount\": 100.00\n}",
							"options": {
								"raw": {
									"language": "json"
								}
							}
						},
						"url": {
							"raw": "http://localhost:3000/api/wallet/deposit",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "3000",
							"path": [
								"api",
								"wallet",
								"deposit"
							]
						}
					},
					"response": []
				},
				{
					"name": "createPaymentSessionRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "{\n  \"document\": \"123456789\",\n  \"amount\": 50.00\n}",
							"options": {
								"raw": {
									"language": "json"
								}
							}
						},
						"url": {
							"raw": "http://localhost:3000/api/wallet/payment/create",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "3000",
							"path": [
								"api",
								"wallet",
								"payment",
								"create"
							]
						}
					},
					"response": []
				},
				{
					"name": "confirmPaymentRequest",
					"request": {
						"auth": {
							"type": "noauth"
						},
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "{\n  \"token\": \"d406ddee858da76db28d2aee846650cf\",\n  \"amount\": 500.00\n}",
							"options": {
								"raw": {
									"language": "json"
								}
							}
						},
						"url": {
							"raw": "http://localhost:3000/api/wallet/payment/confirm",
							"protocol": "http",
							"host": [
								"localhost"
							],
							"port": "3000",
							"path": [
								"api",
								"wallet",
								"payment",
								"confirm"
							]
						}
					},
					"response": []
				}
			]
		}
	]
}